; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_12 ?v11 ?v4)
             (pred_10 ?v8 ?v3)
             (pred_1 ?v11 ?v3)
             (pred_2 ?v6 ?v11 )
	     (pred_5 ?v11)
             (pred_4 ?v13)
             (pred_6 ?v8)
             (pred_9 ?v3)
             (pred_11 ?v11)
             (pred_8 ?v8)
             (pred_7 ?v11)
             (pred_3 ))



(:action op_1
:parameters (?v7 ?v10 ?v9 ?v1)
:precondition (and (pred_4 ?v7) (pred_4 ?v10) (pred_6 ?v9) (pred_9 ?v1)
          (pred_12 ?v7 ?v10) (pred_10 ?v9 ?v1)
                   (pred_1 ?v10 ?v1) (pred_5 ?v7) 
                   (pred_11 ?v10) (pred_8 ?v9))
:effect (and  (pred_7 ?v10) (not (pred_11 ?v10))))


(:action op_5
:parameters (?v7 ?v2)
:precondition (and (pred_4 ?v7) (pred_4 ?v2)
               (pred_5 ?v7) (pred_12 ?v7 ?v2) (pred_7 ?v2))
:effect (and (pred_5 ?v2) (not (pred_5 ?v7))))

(:action op_2
:parameters (?v7 ?v9)
:precondition (and (pred_4 ?v7) (pred_6 ?v9) 
                  (pred_5 ?v7) (pred_2 ?v9 ?v7) (pred_3 ))
:effect (and (pred_8 ?v9)
   (not (pred_2 ?v9 ?v7)) (not (pred_3 ))))


(:action op_4
:parameters (?v7 ?v5 ?v12)
:precondition (and (pred_4 ?v7) (pred_6 ?v5) (pred_6 ?v12)
                  (pred_5 ?v7) (pred_8 ?v12) (pred_2 ?v5 ?v7))
:effect (and (pred_8 ?v5) (pred_2 ?v12 ?v7)
        (not (pred_8 ?v12)) (not (pred_2 ?v5 ?v7))))

(:action op_3
:parameters (?v7 ?v9)
:precondition (and (pred_4 ?v7) (pred_6 ?v9) 
                  (pred_5 ?v7) (pred_8 ?v9))
:effect (and (pred_3 ) (pred_2 ?v9 ?v7) (not (pred_8 ?v9)))))

; problem
(define (problem grid-5-5-3-4-4)
    (:domain grid)
    (:objects
    obj_16 obj_31 obj_30 obj_22 obj_05 obj_26 obj_32 obj_19 obj_23 obj_18 obj_10 obj_09 obj_25 obj_01 obj_03 obj_20 obj_07 obj_17 obj_27 obj_14 obj_12 obj_06 obj_11 obj_29 obj_24
    obj_21 obj_13 obj_04
    obj_15 obj_08 obj_02 obj_28
    )

    (:init
       (pred_3)

       (pred_4 obj_16)
       (pred_4 obj_31)
       (pred_4 obj_30)
       (pred_4 obj_22)
       (pred_4 obj_05)
       (pred_4 obj_26)
       (pred_4 obj_32)
       (pred_4 obj_19)
       (pred_4 obj_23)
       (pred_4 obj_18)
       (pred_4 obj_10)
       (pred_4 obj_09)
       (pred_4 obj_25)
       (pred_4 obj_01)
       (pred_4 obj_03)
       (pred_4 obj_20)
       (pred_4 obj_07)
       (pred_4 obj_17)
       (pred_4 obj_27)
       (pred_4 obj_14)
       (pred_4 obj_12)
       (pred_4 obj_06)
       (pred_4 obj_11)
       (pred_4 obj_29)
       (pred_4 obj_24)
       (pred_9 obj_21)
       (pred_9 obj_13)
       (pred_9 obj_04)
       (pred_6 obj_15)
       (pred_6 obj_08)
       (pred_6 obj_02)
       (pred_6 obj_28)

       (pred_12 obj_16 obj_26)
       (pred_12 obj_16 obj_31)
       (pred_12 obj_31 obj_32)
       (pred_12 obj_31 obj_30)
       (pred_12 obj_31 obj_16)
       (pred_12 obj_30 obj_19)
       (pred_12 obj_30 obj_22)
       (pred_12 obj_30 obj_31)
       (pred_12 obj_22 obj_23)
       (pred_12 obj_22 obj_05)
       (pred_12 obj_22 obj_30)
       (pred_12 obj_05 obj_18)
       (pred_12 obj_05 obj_22)
       (pred_12 obj_26 obj_10)
       (pred_12 obj_26 obj_32)
       (pred_12 obj_26 obj_16)
       (pred_12 obj_32 obj_09)
       (pred_12 obj_32 obj_19)
       (pred_12 obj_32 obj_31)
       (pred_12 obj_32 obj_26)
       (pred_12 obj_19 obj_25)
       (pred_12 obj_19 obj_23)
       (pred_12 obj_19 obj_30)
       (pred_12 obj_19 obj_32)
       (pred_12 obj_23 obj_01)
       (pred_12 obj_23 obj_18)
       (pred_12 obj_23 obj_22)
       (pred_12 obj_23 obj_19)
       (pred_12 obj_18 obj_03)
       (pred_12 obj_18 obj_05)
       (pred_12 obj_18 obj_23)
       (pred_12 obj_10 obj_20)
       (pred_12 obj_10 obj_09)
       (pred_12 obj_10 obj_26)
       (pred_12 obj_09 obj_07)
       (pred_12 obj_09 obj_25)
       (pred_12 obj_09 obj_32)
       (pred_12 obj_09 obj_10)
       (pred_12 obj_25 obj_17)
       (pred_12 obj_25 obj_01)
       (pred_12 obj_25 obj_19)
       (pred_12 obj_25 obj_09)
       (pred_12 obj_01 obj_27)
       (pred_12 obj_01 obj_03)
       (pred_12 obj_01 obj_23)
       (pred_12 obj_01 obj_25)
       (pred_12 obj_03 obj_14)
       (pred_12 obj_03 obj_18)
       (pred_12 obj_03 obj_01)
       (pred_12 obj_20 obj_12)
       (pred_12 obj_20 obj_07)
       (pred_12 obj_20 obj_10)
       (pred_12 obj_07 obj_06)
       (pred_12 obj_07 obj_17)
       (pred_12 obj_07 obj_09)
       (pred_12 obj_07 obj_20)
       (pred_12 obj_17 obj_11)
       (pred_12 obj_17 obj_27)
       (pred_12 obj_17 obj_25)
       (pred_12 obj_17 obj_07)
       (pred_12 obj_27 obj_29)
       (pred_12 obj_27 obj_14)
       (pred_12 obj_27 obj_01)
       (pred_12 obj_27 obj_17)
       (pred_12 obj_14 obj_24)
       (pred_12 obj_14 obj_03)
       (pred_12 obj_14 obj_27)
       (pred_12 obj_12 obj_06)
       (pred_12 obj_12 obj_20)
       (pred_12 obj_06 obj_11)
       (pred_12 obj_06 obj_07)
       (pred_12 obj_06 obj_12)
       (pred_12 obj_11 obj_29)
       (pred_12 obj_11 obj_17)
       (pred_12 obj_11 obj_06)
       (pred_12 obj_29 obj_24)
       (pred_12 obj_29 obj_27)
       (pred_12 obj_29 obj_11)
       (pred_12 obj_24 obj_14)
       (pred_12 obj_24 obj_29)
       (pred_11 obj_17)
       (pred_11 obj_24)
       (pred_11 obj_09)
       (pred_11 obj_03)
       (pred_1  obj_17 obj_21)
       (pred_1  obj_24 obj_13)
       (pred_1  obj_09 obj_04)
       (pred_1  obj_03 obj_21)
       (pred_7 obj_16)
       (pred_7 obj_31)
       (pred_7 obj_30)
       (pred_7 obj_22)
       (pred_7 obj_05)
       (pred_7 obj_26)
       (pred_7 obj_32)
       (pred_7 obj_19)
       (pred_7 obj_23)
       (pred_7 obj_18)
       (pred_7 obj_10)
       (pred_7 obj_25)
       (pred_7 obj_01)
       (pred_7 obj_20)
       (pred_7 obj_07)
       (pred_7 obj_27)
       (pred_7 obj_14)
       (pred_7 obj_12)
       (pred_7 obj_06)
       (pred_7 obj_11)
       (pred_7 obj_29)

       (pred_10  obj_15 obj_21)
       (pred_10  obj_08 obj_13)
       (pred_10  obj_02 obj_04)
       (pred_10  obj_28 obj_04)
       (pred_2 obj_15 obj_26)
       (pred_2 obj_08 obj_17)
       (pred_2 obj_02 obj_31)
       (pred_2 obj_28 obj_12)
       (pred_5 obj_19)
    )

    (:goal (and
       (pred_2 obj_15 obj_14)
       (pred_2 obj_28 obj_07)
    ))
(:constraints
  (always (not (pred_5 obj_32)))
)
)

; plan
1. (op_5 obj_19 obj_23)
   deleted: (pred_5 obj_19)
   added: (pred_5 obj_23)
   goals met: 0 of 2
2. (op_5 obj_23 obj_01)
   deleted: (pred_5 obj_23)
   added: (pred_5 obj_01)
   goals met: 0 of 2
3. (op_5 obj_01 obj_27)
   deleted: (pred_5 obj_01)
   added: (pred_5 obj_27)
   goals met: 0 of 2
4. (op_5 obj_27 obj_29)
   deleted: (pred_5 obj_27)
   added: (pred_5 obj_29)
   goals met: 0 of 2
5. (op_5 obj_29 obj_11)
   deleted: (pred_5 obj_29)
   added: (pred_5 obj_11)
   goals met: 0 of 2
6. (op_5 obj_11 obj_06)
   deleted: (pred_5 obj_11)
   added: (pred_5 obj_06)
   goals met: 0 of 2
7. (op_5 obj_06 obj_12)
   deleted: (pred_5 obj_06)
   added: (pred_5 obj_12)
   goals met: 0 of 2
8. (op_2 obj_12 obj_28)
   deleted: (pred_2 obj_28 obj_12) (pred_3)
   added: (pred_8 obj_28)
   goals met: 0 of 2
9. (op_5 obj_12 obj_06)
   deleted: (pred_5 obj_12)
   added: (pred_5 obj_06)
   goals met: 0 of 2
10. (op_5 obj_06 obj_07)
   deleted: (pred_5 obj_06)
   added: (pred_5 obj_07)
   goals met: 0 of 2
11. (op_3 obj_07 obj_28)
   deleted: (pred_8 obj_28)
   added: (pred_3) (pred_2 obj_28 obj_07)
   goals met: 1 of 2
12. (op_5 obj_07 obj_20)
   deleted: (pred_5 obj_07)
   added: (pred_5 obj_20)
   goals met: 1 of 2
13. (op_5 obj_20 obj_10)
   deleted: (pred_5 obj_20)
   added: (pred_5 obj_10)
   goals met: 1 of 2
14. (op_5 obj_10 obj_26)
   deleted: (pred_5 obj_10)
   added: (pred_5 obj_26)
   goals met: 1 of 2
15. (op_2 obj_26 obj_15)
   deleted: (pred_2 obj_15 obj_26) (pred_3)
   added: (pred_8 obj_15)
   goals met: 1 of 2
16. (op_5 obj_26 obj_10)
   deleted: (pred_5 obj_26)
   added: (pred_5 obj_10)
   goals met: 1 of 2
17. (op_5 obj_10 obj_20)
   deleted: (pred_5 obj_10)
   added: (pred_5 obj_20)
   goals met: 1 of 2
18. (op_5 obj_20 obj_07)
   deleted: (pred_5 obj_20)
   added: (pred_5 obj_07)
   goals met: 1 of 2
19. (op_1 obj_07 obj_17 obj_15 obj_21)
   deleted: (pred_11 obj_17)
   added: (pred_7 obj_17)
   goals met: 1 of 2
20. (op_5 obj_07 obj_17)
   deleted: (pred_5 obj_07)
   added: (pred_5 obj_17)
   goals met: 1 of 2
21. (op_5 obj_17 obj_27)
   deleted: (pred_5 obj_17)
   added: (pred_5 obj_27)
   goals met: 1 of 2
22. (op_5 obj_27 obj_14)
   deleted: (pred_5 obj_27)
   added: (pred_5 obj_14)
   goals met: 1 of 2
23. (op_3 obj_14 obj_15)
   deleted: (pred_8 obj_15)
   added: (pred_3) (pred_2 obj_15 obj_14)
   goals met: 2 of 2
